tests/data/wrk2-output/output.txt
Running 5s test @ http://localhost:8080/
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.89ms  358.56us   2.01ms   66.07%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.88ms
 75.000%    1.17ms
 90.000%    1.34ms
 99.000%    1.59ms
 99.900%    1.77ms
 99.990%    2.01ms
 99.999%    2.01ms
100.000%    2.01ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.091     0.000000            1         1.00
       0.415     0.100000          500         1.11
       0.565     0.200000          999         1.25
       0.665     0.300000         1498         1.43
       0.774     0.400000         1997         1.67
       0.876     0.500000         2496         2.00
       0.932     0.550000         2750         2.22
       1.012     0.600000         2996         2.50
       1.080     0.650000         3248         2.86
       1.124     0.700000         3496         3.33
       1.174     0.750000         3745         4.00
       1.197     0.775000         3870         4.44
       1.220     0.800000         3999         5.00
       1.241     0.825000         4119         5.71
       1.260     0.850000         4247         6.67
       1.285     0.875000         4374         8.00
       1.306     0.887500         4431         8.89
       1.337     0.900000         4494        10.00
       1.371     0.912500         4558        11.43
       1.425     0.925000         4618        13.33
       1.456     0.937500         4681        16.00
       1.465     0.943750         4712        17.78
       1.475     0.950000         4745        20.00
       1.488     0.956250         4774        22.86
       1.505     0.962500         4807        26.67
       1.523     0.968750         4838        32.00
       1.534     0.971875         4852        35.56
       1.548     0.975000         4868        40.00
       1.558     0.978125         4885        45.71
       1.569     0.981250         4900        53.33
       1.574     0.984375         4915        64.00
       1.576     0.985938         4923        71.11
       1.580     0.987500         4930        80.00
       1.585     0.989062         4938        91.43
       1.596     0.990625         4946       106.67
       1.603     0.992188         4953       128.00
       1.611     0.992969         4957       142.22
       1.623     0.993750         4962       160.00
       1.626     0.994531         4965       182.86
       1.635     0.995313         4969       213.33
       1.659     0.996094         4973       256.00
       1.663     0.996484         4975       284.44
       1.670     0.996875         4977       320.00
       1.673     0.997266         4980       365.71
       1.703     0.997656         4981       426.67
       1.721     0.998047         4983       512.00
       1.741     0.998242         4984       568.89
       1.758     0.998437         4985       640.00
       1.766     0.998633         4986       731.43
       1.775     0.998828         4987       853.33
       1.814     0.999023         4988      1024.00
       1.814     0.999121         4988      1137.78
       1.841     0.999219         4989      1280.00
       1.841     0.999316         4989      1462.86
       1.891     0.999414         4990      1706.67
       1.891     0.999512         4990      2048.00
       1.891     0.999561         4990      2275.56
       1.902     0.999609         4991      2560.00
       1.902     0.999658         4991      2925.71
       1.902     0.999707         4991      3413.33
       1.902     0.999756         4991      4096.00
       1.902     0.999780         4991      4551.11
       2.008     0.999805         4992      5120.00
       2.008     1.000000         4992          inf
#[Mean    =        0.887, StdDeviation   =        0.359]
#[Max     =        2.008, Total count    =         4992]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4994 requests in 5.00s, 14.13MB read
Requests/sec:    998.43
Transfer/sec:      2.83MB